print("   Задание 1")
# str1=input("введите строку: ")
str1 = '123'
print(' Строка: '+str1)
try:
    print('1) третий символ: "' + str1[2] + '"',
          '2) предпоследний символ: "' + str1[-2] + '"',
          '3) 0..4 символ: "' + str1[0:5] + '"',
          '4) кроме последних двух символов: "' + str1[0:-2] + '"',
          '5) все символы с четными индексами : "' + str1[0::2] + '"',
          '6) все символы с нечетными индексами : "' + str1[1::2] + '"',
          '7) в обратном порядке : "' + str1[::-1] + '"',
          '8) через один в обратном порядке, начиная с последнего : "' + str1[-1::-2] + '"',
          '9) через один в обратном порядке, начиная с предпоследнего : "' + str1[-2::-2] + '"',
          '10) в обратном порядке : "' + str1[-2:0:-1] + '"',
          '11) длина строки : "' + (str)(len(str1)) + '"',
          sep='\n')
except IndexError as e:
    print('IndexError:'+(str)(e)+'\n'+'Ошибка при длине строки : "' + (str)(len(str1)) + '"')

print("#######################")
print("   Задание 2")
print("1/2 (L(+1)): "+str1[0:(int)(len(str1)/2+len(str1)%2)]+ ' <-------> '+str1[(int)(len(str1)/2+len(str1)%2):])
str2=str1[(int)(len(str1)/2+len(str1)%2):]+str1[0:(int)(len(str1)/2+len(str1)%2)]
print(str2)
